# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний 
# элемент, второй и предпоследний и т.д.

# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

first_list = [2, 3, 4, 5, 6]
result = []
for i in range((len(first_list)+1)//2):
    result.append(first_list[i]*first_list[len(first_list)-1-i])
print(result)